Repository: 24-pay/24payprestashop_9
Catalog: pg24pay/translations/*/ModulesPg24payBackoffice.*.xlf
Languages: sk_sk

source: This module allows you to accept payments with 24-pay payment gateway
sk_sk: Tento modul Vám umožní príjimáť platby prostredníctom platobnej brány 24-pay

source: Payment gateway 24-Pay allows customers to pay with card or through internet banking.
sk_sk: Platobná brána 24-pay umožňuje zákazníkom platiť katrou a cez internet banking.

source: High level of security, smooth online payment processing, supports 3D Secure security standards.
sk_sk: Vysoká úroveň zabezpečenia, plynulé spracovanie platieb online, podpora 3D Secure bezpečnostných štandardov.

source: Home
sk_sk: Domov

source: 24-pay Settings
sk_sk: Nastavenie 24-pay

source: TEST ENVIROMENT
sk_sk: Testovacie prostredie

source: Yes
sk_sk: Áno

source: No
sk_sk: Nie

source: E-ESHOP ID
sk_sk: E-shop Id

source: KEY
sk_sk: Kľúč

source: Show direct Google Pay payment option
sk_sk: Zobraziť priamo Platbu cez GooglePay

source: Show direct Apple Pay payment option
sk_sk: Zobraziť priamo Platbu cez Apple Pay

source: Send payment status email to client
sk_sk: Chcete posielat klientovi notifikačný email o stave platby z 24-pay

source: Receive notification email from 24-pay
sk_sk: Chcete dostávať notifikačný email o platbe z 24-pay

source: Send offline payment link in case of no response or declined payment
sk_sk: Odoslať odkaz na offline platbu v prípade platby bez odpovede alebo zamietnutej platby

source: Email for notification
sk_sk: Notifikačný email

source: Email address is missing
sk_sk: Parameter Email je povinný!

source: ADVANCE SETTING
sk_sk: Pokročilé nastavenia

source: DEBUG MODULE PAYMENT
sk_sk: Odladiť modul

source: Last step will show all data and require confirmation
sk_sk: V poslednom kroku sa zobrazia všetky údaje a je potrebné potvrdiť odoslanie

source: In case you set the value to
sk_sk: V prípade ak nastavíte hodnotu na

source: responsibility for the problems caused by this setting is yours.
sk_sk: zodpovednosť za prípadne problémy je na strane obchodníka.

source: CREATE ORDER ON FAIL PAYMENT
sk_sk: Vytvoriť objednávku pri neúspešnej platbe

source: Recommended
sk_sk: Odporúčamé

source: LOG PAYMENT NOTIFICATION
sk_sk: Zaznamenávať notifikačné správy

source: Save
sk_sk: Uložiť

source: 24-pay Setting Test
sk_sk: Otestovať nastavenia 24-pay

source: Test result
sk_sk: Výsledok testu

source: Sign
sk_sk: Podpisovanie

source: Active gates
sk_sk: Aktívne brány

source: Click on button test below and launch the 24-pay settings test
sk_sk: Kliknite na tlačidlo "Test" pre spustenie testu.
